# https://h1g.jp/genshin/?%E9%81%8E%E5%8E%BB%E3%81%AE%E3%82%AC%E3%83%81%E3%83%A3%E6%83%85%E5%A0%B1
from collections import Counter
# g は gatya　の略
g_01 = ["ウェンティ", "シャンリン", "フィッシュル", "バーバラ"]
g_02 = ["クレー", "スクロース", "行秋", "ノエル"]
g_03 = ["タルタル", "凝光", "北斗", "ディオナ"]
g_04 = ["鍾離", "レザー", "重雲", "辛炎"]
g_05 = ["アルベド", "フィッシュル", "スクロース", "ベネット"]
g_06 = ["甘雨", "シャンリン", "行秋", "ノエル"]
g_07 = ["魈", "辛炎", "北斗", "ディオナ"]
g_08 = ["刻晴", "凝光", "ベネット", "バーバラ"]
g_09 = ["フータオ", "シャンリン", "行秋", "重雲"]
g_10 = ["ウェンティ", "レザー", "スクロース", "ノエル"]
g_11 = ["タルタル", "フィッシュル", "バーバラ", "ロサリア"]

g_XX = []


g_XX = g_01 + g_02 + g_03 + g_04 + g_05 + \
    g_06 + g_07 + g_08 + g_09 + g_10 + g_11
# print(g_XX)

# for i in range(1, 8*4):
# print(g_XX[i])
print(Counter(g_XX))
